// ЗАДАНИЕ 1

// const user = prompt ("У квадратного стола отпилили один угол. Сколько теперь углов у него стало?");

// if ( user === '5') {
//         alert ('Верно');
//     } else if (user === 'five') {
//         alert ('Верно');
//     } else {
//         alert ('Не верно');
//     }














//=======================================================================================================================================
// ЗАДАНИЕ 2

// const user = parseInt(prompt("Сколько тебе лет?"));

// if (user < 1 || user > 100) {
//     alert('норм возраст возьми да');

// } else if (user <= 13) {
//     alert('чекни мультик фин и джейк');

// } else if (user <= 17) {
//     alert('чекни фильм безумный макс');

// } else if (user >= 18) {
//     alert ('чекни фильм оппенгеймер')

// } else {
//     alert('норм возраст возьми да');
// }













// =======================================================================================================================================
// ЗАДАНИЕ 3 

// const napitok = prompt ('Выбери себе напиток: vodka, coffee, water')

// switch (napitok) {
//     case "vodka":
//     alert ('ты не молодец')
//     break;

//     case "coffee":
//     alert ('ты не молодец')
//     break;

//     case "water":
//     alert ('ты молодец')
//     break;

//     default:
//     alert ('ты ничего не выбрал');
//     break;
// }
















// ===================================================================================================================================
// ЗАДАНИЕ 4 

// let number = 10;

// if (number === 11) { // <------------------------- ставим ===
//     alert('Number is 11!');

// } else {
//     alert('Number is 10!');
// }

// // если мы хотим что б выводило число 10 то мы сранивать а не присваивать.





















// ======================================================================================================================================
// ЗАДАНИЕ 5 

// (2 < 3) && (3 > 4) || true

// true && false || true

// false || true

// true 
 
// ===============================

// !true && (!true || 100 != 5 * 5)

// !true && ( false || false )

// !true && false

// false && false 

// true

// ===============================

// ("123" == 123) || ((10 <= 10) && ('' === false))

// true || (true && true)

// true || true 

// true
















//===========================================================================================================================
// ЗАДАНИЕ 6

// let isRaining = true;
// let isSunny = false;

// console.log(isRaining || isSunny);











//===================================================================================
// ЗАДАНИЕ 7


// const numberAsString = '42';

// const number = parseInt(numberAsString);

// console.log (number + 10);











//==========================================================================================
// ЗАДАНИЕ 8

// const age = 25

// if (age > 18 ) {
//     console.log('вы старый');

// }  else if (age = 18) {
//     console.log('мы ровесники');
// }













//=================================================================================
// ЗАДАНИЕ 9 

// const isWeekend = true
// const hasTimeOff = false

// if (isWeekend || hasTimeOff) {
//     console.log ('У вас есть выходные и вы можете отдохнуть')
// } 













//======================================================================================
// ЗАДАНИЕ 10

// const password = 'MySecretPassword123'

// if ( password.length >= 8 && /\d/.test(password) && /[A-Z]/.test(password) ) {
//     console.log('ваш пороль подходит');

// } else {
//     console.log ('ваш пороль нельзя использывать');
// }











//=========================================================================================
// ЗАДАНИЕ 11

// const studentGrade = prompt ('твоя оценка за экзамен')

// if (studentGrade >= 90) {
//     alert ('отлично');

// } else if (studentGrade >= 70 && studentGrade < 90) {
//     alert ('хорошо');

// } else  {
//     alert ('попробуйте еще раз');
// }













//================================================================================
// ЗАДАНИЕ 12 

// const currentDate = new Date (2024, 2, 4)
// const kurrentDate = new Date (2023, 8, 1)


// if (currentDate >= kurrentDate ) {
//     console.log('добро пожаловать');

// } else {
//     console.log('Скоро начнем');
// }
